
## Terraform Comment

**Project:** terraform/projects/mathews-mrr-prd

**Command:** plan

**Outcome:** success

<details>
  <summary>
    <b>Output: </b>
  </summary>

  <pre>
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.artifact_registry.google_artifact_registry_repository.main will be created
  + resource "google_artifact_registry_repository" "main" {
      + create_time      = (known after apply)
      + description      = "dbt Project Artifact Registry Repository"
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = "us-central1"
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "mathews-mrr-prd"
      + registry_uri     = (known after apply)
      + repository_id    = "dbt-project"
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time      = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-old-images"

          + condition {
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
                # (2 unchanged attributes hidden)
            }
        }
      + cleanup_policies {
          + action = "KEEP"
          + id     = "keep-last-n-versions"

          + most_recent_versions {
              + keep_count            = 3
              + package_name_prefixes = []
            }
        }

      + vulnerability_scanning_config (known after apply)
    }

  # module.bigquery.google_bigquery_dataset.main will be created
  + resource "google_bigquery_dataset" "main" {
      + creation_time              = (known after apply)
      + dataset_id                 = "raw"
      + default_collation          = (known after apply)
      + delete_contents_on_destroy = false
      + effective_labels           = {
          + "goog-terraform-provisioned" = "true"
        }
      + etag                       = (known after apply)
      + friendly_name              = "Raw Dataset"
      + id                         = (known after apply)
      + is_case_insensitive        = (known after apply)
      + last_modified_time         = (known after apply)
      + location                   = "US"
      + max_time_travel_hours      = (known after apply)
      + project                    = "mathews-mrr-prd"
      + self_link                  = (known after apply)
      + storage_billing_model      = (known after apply)
      + terraform_labels           = {
          + "goog-terraform-provisioned" = "true"
        }

      + access (known after apply)
    }

  # module.bigquery.google_bigquery_table.main["incomes"] will be created
  + resource "google_bigquery_table" "main" {
      + creation_time                = (known after apply)
      + dataset_id                   = "raw"
      + deletion_protection          = false
      + effective_labels             = {
          + "goog-terraform-provisioned" = "true"
        }
      + etag                         = (known after apply)
      + expiration_time              = (known after apply)
      + generated_schema_columns     = (known after apply)
      + id                           = (known after apply)
      + ignore_auto_generated_schema = false
      + last_modified_time           = (known after apply)
      + location                     = (known after apply)
      + max_staleness                = (known after apply)
      + num_bytes                    = (known after apply)
      + num_long_term_bytes          = (known after apply)
      + num_rows                     = (known after apply)
      + project                      = "mathews-mrr-prd"
      + schema                       = (known after apply)
      + self_link                    = (known after apply)
      + table_id                     = "google_sheets__incomes"
      + terraform_labels             = {
          + "goog-terraform-provisioned" = "true"
        }
      + type                         = (known after apply)

      + external_data_configuration {
          + autodetect    = false
          + compression   = "NONE"
          + schema        = jsonencode(
                [
                  + {
                      + name = "tran_date"
                      + type = "STRING"
                    },
                  + {
                      + name = "tran_payer"
                      + type = "STRING"
                    },
                  + {
                      + name = "tran_payee"
                      + type = "STRING"
                    },
                  + {
                      + name = "tran_payer_payee_relation"
                      + type = "STRING"
                    },
                  + {
                      + name = "tran_category"
                      + type = "STRING"
                    },
                  + {
                      + name = "tran_detail"
                      + type = "STRING"
                    },
                  + {
                      + name = "tran_currency"
                      + type = "STRING"
                    },
                  + {
                      + name = "tran_net"
                      + type = "STRING"
                    },
                  + {
                      + name = "tran_gross"
                      + type = "STRING"
                    },
                  + {
                      + name = "tran_gross_delta_category"
                      + type = "STRING"
                    },
                  + {
                      + name = "tran_gross_delta_detail"
                      + type = "STRING"
                    },
                  + {
                      + name = "accounting_month"
                      + type = "STRING"
                    },
                  + {
                      + name = "accounting_status"
                      + type = "STRING"
                    },
                ]
            )
          + source_format = "GOOGLE_SHEETS"
          + source_uris   = [
              + "https://docs.google.com/spreadsheets/d/1BAdR_wHcAb2o7WAIBK36hdH-yTRt7HG8Vt-RcZFkBik",
            ]

          + google_sheets_options {
              + range             = "Incomes"
              + skip_leading_rows = 1
            }
        }
    }

  # module.dbt_project_bucket.google_storage_bucket.main will be created
  + resource "google_storage_bucket" "main" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "US"
      + name                        = "mathews-mrr-prd-dbt-project-bucket"
      + project                     = "mathews-mrr-prd"
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.dbt_project_bucket.google_storage_bucket_iam_member.main["roles/storage.objectViewer-serviceAccount:github@mathews-mrr-stg.iam.gserviceaccount.com"] will be created
  + resource "google_storage_bucket_iam_member" "main" {
      + bucket = "mathews-mrr-prd-dbt-project-bucket"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:github@mathews-mrr-stg.iam.gserviceaccount.com"
      + role   = "roles/storage.objectViewer"
    }

  # module.dbt_project_sa.google_project_iam_member.main["roles/bigquery.dataEditor"] will be created
  + resource "google_project_iam_member" "main" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:dbt-project@mathews-mrr-prd.iam.gserviceaccount.com"
      + project = "mathews-mrr-prd"
      + role    = "roles/bigquery.dataEditor"
    }

  # module.dbt_project_sa.google_project_iam_member.main["roles/bigquery.user"] will be created
  + resource "google_project_iam_member" "main" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:dbt-project@mathews-mrr-prd.iam.gserviceaccount.com"
      + project = "mathews-mrr-prd"
      + role    = "roles/bigquery.user"
    }

  # module.dbt_project_sa.google_service_account.main will be created
  + resource "google_service_account" "main" {
      + account_id                   = "dbt-project"
      + create_ignore_already_exists = true
      + description                  = "DBT Project Service Account"
      + disabled                     = false
      + display_name                 = "dbt-project"
      + email                        = "dbt-project@mathews-mrr-prd.iam.gserviceaccount.com"
      + id                           = (known after apply)
      + member                       = "serviceAccount:dbt-project@mathews-mrr-prd.iam.gserviceaccount.com"
      + name                         = (known after apply)
      + project                      = "mathews-mrr-prd"
      + unique_id                    = (known after apply)
    }

  # module.service.google_project_service.main["artifactregistry.googleapis.com"] will be created
  + resource "google_project_service" "main" {
      + id      = (known after apply)
      + project = "mathews-mrr-prd"
      + service = "artifactregistry.googleapis.com"
    }

  # module.service.google_project_service.main["iam.googleapis.com"] will be created
  + resource "google_project_service" "main" {
      + id      = (known after apply)
      + project = "mathews-mrr-prd"
      + service = "iam.googleapis.com"
    }

  # module.service.google_project_service.main["run.googleapis.com"] will be created
  + resource "google_project_service" "main" {
      + id      = (known after apply)
      + project = "mathews-mrr-prd"
      + service = "run.googleapis.com"
    }

Plan: 11 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: mathews-mrr-prd

To perform exactly these actions, run the following command to apply:
    terraform apply "mathews-mrr-prd"
</pre>
</details>
